tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# CLI for Heroku
brew "heroku"
# LastPass command-line interface tool
brew "lastpass-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua@5.4"
# Package manager for the Lua programming language
brew "luarocks"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Object-relational database system
brew "postgresql@16"
# Object-relational database system
brew "postgresql@17", link: true
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SSH server & client auditing
brew "ssh-audit"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Enable Windows-like alt-tab
cask "alt-tab"
# Allows connection to a computer remotely
cask "anydesk"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Anthropic's official Claude AI desktop app
cask "claude"
# Server and cloud storage browser
cask "cyberduck"
# Productivity app
cask "dropzone"
cask "font-hack-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Chromium-based web browser
cask "helium-browser"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard customiser
cask "karabiner-elements"
# Animated screen capture application
cask "licecap"
# App to manage software development and track bugs
cask "linear"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# VPN client focusing on security
cask "protonvpn"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
